#include "poolcontroller.h"
#include "objects/table.h"

PoolController::PoolController()
{
}

void PoolController::calculateHit()
{
    // TODO: проверить, что есть двигающиеся шары
    // TODO: для каждого шара найти, через сколько он остановится
    // TODO: для каждого шара найти, через сколько он столкнется со стеной
    // TODO: для каждой пары шаров найти время до столкновения (если столкнутся)
    // TODO: переместить шары ко времени близжайшего события
    // TODO: пересчитать параметры шаров и исключить остановившиеся
}
